[Course Github](https://github.com/Musfique-Ahmed/Shongjog-Python-Course/tree/main)

# Pandas

In [71]:
import pandas as pd

## Creating DataFrame

In [72]:
data = {
    'Name': ['Tamanna', 'Faysal', 'Tarek', 'Raisa', 'Imtiaz', 'Farah'],
    'Age': [24, 27, 22, 32, 24, 22],
    'City': ['Dhaka', 'Sylhet', 'Dhaka', 'Khulna', 'Rajshahi', 'Sylhet'],
    'Score': [85, 95, 78, 90, 88, 84]
}
df = pd.DataFrame(data)

# df["Name"].head()
df = pd.DataFrame(data)
df

      Name  Age      City  Score
0  Tamanna   24     Dhaka     85
1   Faysal   27    Sylhet     95
2    Tarek   22     Dhaka     78
3    Raisa   32    Khulna     90
4   Imtiaz   24  Rajshahi     88
5    Farah   22    Sylhet     84

In [73]:
df["Name"].head()

0    Tamanna
1     Faysal
2      Tarek
3      Raisa
4     Imtiaz
Name: Name, dtype: object

In [74]:
df["City"].head()

0       Dhaka
1      Sylhet
2       Dhaka
3      Khulna
4    Rajshahi
Name: City, dtype: object

In [75]:
df.head()

      Name  Age      City  Score
0  Tamanna   24     Dhaka     85
1   Faysal   27    Sylhet     95
2    Tarek   22     Dhaka     78
3    Raisa   32    Khulna     90
4   Imtiaz   24  Rajshahi     88

In [76]:
df.Age > 30

0    False
1    False
2    False
3     True
4    False
5    False
Name: Age, dtype: bool

In [77]:
df[["Name","Age"]]

      Name  Age
0  Tamanna   24
1   Faysal   27
2    Tarek   22
3    Raisa   32
4   Imtiaz   24
5    Farah   22

In [78]:
df['Area'] = ['Mirpur', 'Moulvibazar', 'Uttara', 'Jessore', 'Pabna', 'Sunamganj']
df

      Name  Age      City  Score         Area
0  Tamanna   24     Dhaka     85       Mirpur
1   Faysal   27    Sylhet     95  Moulvibazar
2    Tarek   22     Dhaka     78       Uttara
3    Raisa   32    Khulna     90      Jessore
4   Imtiaz   24  Rajshahi     88        Pabna
5    Farah   22    Sylhet     84    Sunamganj

In [79]:
df[["Name", "City", "Area"]]

      Name      City         Area
0  Tamanna     Dhaka       Mirpur
1   Faysal    Sylhet  Moulvibazar
2    Tarek     Dhaka       Uttara
3    Raisa    Khulna      Jessore
4   Imtiaz  Rajshahi        Pabna
5    Farah    Sylhet    Sunamganj

## Working with the Rows

df[ start : end ]

In [80]:
df[2 : 4]

    Name  Age    City  Score     Area
2  Tarek   22   Dhaka     78   Uttara
3  Raisa   32  Khulna     90  Jessore

In [81]:
df[0:5]

      Name  Age      City  Score         Area
0  Tamanna   24     Dhaka     85       Mirpur
1   Faysal   27    Sylhet     95  Moulvibazar
2    Tarek   22     Dhaka     78       Uttara
3    Raisa   32    Khulna     90      Jessore
4   Imtiaz   24  Rajshahi     88        Pabna

In [82]:
df["Name"].iloc[3]

'Raisa'

In [83]:
df[["Name", "Score"]].iloc[3]

Name     Raisa
Score       90
Name: 3, dtype: object

In [84]:
df[["Name", "City", "Area"]].iloc[3]

Name      Raisa
City     Khulna
Area    Jessore
Name: 3, dtype: object

In [85]:
df['Job'] = ['Teacher', 'Doctor', 'Teacher', 'Pilot', 'Markter', 'Teacher']
df

      Name  Age      City  Score         Area      Job
0  Tamanna   24     Dhaka     85       Mirpur  Teacher
1   Faysal   27    Sylhet     95  Moulvibazar   Doctor
2    Tarek   22     Dhaka     78       Uttara  Teacher
3    Raisa   32    Khulna     90      Jessore    Pilot
4   Imtiaz   24  Rajshahi     88        Pabna  Markter
5    Farah   22    Sylhet     84    Sunamganj  Teacher

In [86]:
df[["Name", "City", "Area", "Job"]].iloc[4]

Name      Imtiaz
City    Rajshahi
Area       Pabna
Job      Markter
Name: 4, dtype: object

In [87]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   City    6 non-null      object
 3   Score   6 non-null      int64
 4   Area    6 non-null      object
 5   Job     6 non-null      object
dtypes: int64(2), object(4)
memory usage: 420.0+ bytes

In [88]:
df['Age'].mean()

np.float64(25.166666666666668)

In [89]:
df.Age.max()

np.int64(32)

In [90]:
df.Age.min()

np.int64(22)

In [91]:
df[df["Age"] > 25]

     Name  Age    City  Score         Area     Job
1  Faysal   27  Sylhet     95  Moulvibazar  Doctor
3   Raisa   32  Khulna     90      Jessore   Pilot

In [92]:
df.Score.max()

np.int64(95)

In [93]:
df.Score.min()

np.int64(78)

In [94]:
df[df["Score"] < 90]

      Name  Age      City  Score       Area      Job
0  Tamanna   24     Dhaka     85     Mirpur  Teacher
2    Tarek   22     Dhaka     78     Uttara  Teacher
4   Imtiaz   24  Rajshahi     88      Pabna  Markter
5    Farah   22    Sylhet     84  Sunamganj  Teacher

In [95]:
df[df["Area"] == 'Mirpur']

      Name  Age   City  Score    Area      Job
0  Tamanna   24  Dhaka     85  Mirpur  Teacher

In [96]:
df[df["City"] == 'Sylthet']

Empty DataFrame
Columns: [Name, Age, City, Score, Area, Job]
Index: []

In [97]:
df

      Name  Age      City  Score         Area      Job
0  Tamanna   24     Dhaka     85       Mirpur  Teacher
1   Faysal   27    Sylhet     95  Moulvibazar   Doctor
2    Tarek   22     Dhaka     78       Uttara  Teacher
3    Raisa   32    Khulna     90      Jessore    Pilot
4   Imtiaz   24  Rajshahi     88        Pabna  Markter
5    Farah   22    Sylhet     84    Sunamganj  Teacher

In [99]:
grouped = df.groupby("City")
print(grouped)

sum_score = grouped["Score"].sum()
sum_score

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000020FA5D09590>

City
Dhaka       163
Khulna       90
Rajshahi     88
Sylhet      179
Name: Score, dtype: int64

In [102]:
max_score = grouped["Score"].max()
max_score

City
Dhaka       85
Khulna      90
Rajshahi    88
Sylhet      95
Name: Score, dtype: int64

In [103]:
min_score = grouped["Score"].min()
min_score

City
Dhaka       78
Khulna      90
Rajshahi    88
Sylhet      84
Name: Score, dtype: int64

## Looping over the groups

In [101]:
for name, group in grouped:
    print(f"City: {name}")
    print(group)
    print("------\n")

City: Dhaka
      Name  Age   City  Score    Area      Job
0  Tamanna   24  Dhaka     85  Mirpur  Teacher
2    Tarek   22  Dhaka     78  Uttara  Teacher
------

City: Khulna
    Name  Age    City  Score     Area    Job
3  Raisa   32  Khulna     90  Jessore  Pilot
------

City: Rajshahi
     Name  Age      City  Score   Area      Job
4  Imtiaz   24  Rajshahi     88  Pabna  Markter
------

City: Sylhet
     Name  Age    City  Score         Area      Job
1  Faysal   27  Sylhet     95  Moulvibazar   Doctor
5   Farah   22  Sylhet     84    Sunamganj  Teacher
------

In [104]:
for name, group in grouped:
    print(f"Score: {name}")
    print(group)
    print("------\n")

Score: Dhaka
      Name  Age   City  Score    Area      Job
0  Tamanna   24  Dhaka     85  Mirpur  Teacher
2    Tarek   22  Dhaka     78  Uttara  Teacher
------

Score: Khulna
    Name  Age    City  Score     Area    Job
3  Raisa   32  Khulna     90  Jessore  Pilot
------

Score: Rajshahi
     Name  Age      City  Score   Area      Job
4  Imtiaz   24  Rajshahi     88  Pabna  Markter
------

Score: Sylhet
     Name  Age    City  Score         Area      Job
1  Faysal   27  Sylhet     95  Moulvibazar   Doctor
5   Farah   22  Sylhet     84    Sunamganj  Teacher
------

In [109]:
agg_result = df.groupby('City')['Score'].agg(['mean', 'max', 'min'])
agg_result

          mean  max  min
City
Dhaka     81.5   85   78
Khulna    90.0   90   90
Rajshahi  88.0   88   88
Sylhet    89.5   95   84

## Apply

In pandas, the apply function is used to apply a function along an axis of a DataFrame or specific groups within a DataFrame.

In [110]:
def top(group):
    return group.nlargest(2, "Score")

result = df.groupby("Age").apply(top)
result

C:\Users\USER\AppData\Local\Temp\ipykernel_11192\1675888640.py:4: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  result = df.groupby("Age").apply(top)

          Name  Age      City  Score         Area      Job
Age
22  5    Farah   22    Sylhet     84    Sunamganj  Teacher
    2    Tarek   22     Dhaka     78       Uttara  Teacher
24  4   Imtiaz   24  Rajshahi     88        Pabna  Markter
    0  Tamanna   24     Dhaka     85       Mirpur  Teacher
27  1   Faysal   27    Sylhet     95  Moulvibazar   Doctor
32  3    Raisa   32    Khulna     90      Jessore    Pilot

## Categorical Values

●	Categorical/dictionary-encoded representation: using integers to identify unique values

●	The array of distinct values is called categories

●	The integer values that represent the categories are called codes

●	This yields significant performance improvements and is a better representation of data for models

Color (Original) | Code (Encoded)
----------------|----------------
Red             | 0
Blue            | 1
Red             | 0
Green           | 2
Blue            | 1

In [111]:
df = pd.DataFrame({'Color': ['Red', 'Blue', 'Red', 'Green', 'Blue']})
df

   Color
0    Red
1   Blue
2    Red
3  Green
4   Blue

In [112]:
# Convert the 'Color' column to a categorical type
df['Color'] = df['Color'].astype('category')
#color=df['Color'].astype('category')
#print(color.values)
# Get the categories (distinct values)
categories = df['Color'].cat.categories
print("Categories:", categories)

# Get the codes (integer representation)
codes = df['Color'].cat.codes
print("Codes:\n", codes)

# Add the codes to the DataFrame
df['Color_Code'] = codes
print("\nEncoded DataFrame:\n", df)

Categories: Index(['Blue', 'Green', 'Red'], dtype='object')
Codes:
 0    2
1    0
2    2
3    1
4    0
dtype: int8

Encoded DataFrame:
    Color  Color_Code
0    Red           2
1   Blue           0
2    Red           2
3  Green           1
4   Blue           0